/*===== << 이 부분은 실습을 위하여 수정 금지 >> =====*/
#include "my_lib.h"
#define 	printf		Uart_Printf
#define 	main		User_Main
void User_Main(void);
void Main(void)
{
	Uart_Init(115200);	
	printf("\n=================================\n");
	main();
	printf("=================================\n");
}

/*===== << 여기부터 사용자 프로그램을 작성함 >> =====*/

/***********************************************************/
// [예비문제 1]  add
/***********************************************************/

/*
int add(int a, int b)
{
	int c;

	c = a + b;
	return c;
}

void main(void)
{
	int a,b,c;
	a=5, b=10;
	c=add(a+2,b+3);

	printf("%d\n",c);

}
*/

/***********************************************************/
// [예비문제 2]  sum
/***********************************************************/

/*
int sum( int    *a)
{
	int c; int j;

	c = 0;
	
	for(j=0;j<10;j++) c+=a[j];

	return c;
}

void main(void)
{
	int x[10] = {1,3,5,6,8,9,5,3,6,8};
	int c;
	c = sum(x);
	printf("%d\n", c);
}
*/

/***********************************************************/
// [예비문제 3]  add2
/***********************************************************/

/*

int * add2(  int   *a,     int *b)
{
	int j;
    static int     c[]=  {0,0,0,0,0,0,0,0,0,0    };
  

	for(j=0;j<10;j++) c[j] = 0;	
	for(j=0;j<10;j++) 
	{
		c[j] = a[j]+b[j];
		printf("%d\n",c[j]);
	}
	return c;
}

void main(void)
{
	int x[10] = {11,12,13,14,15,16,17,18,19,20 };
	int y[10] = {31,32,33,34,35,36,37,38,39,40};
	int *c; int j;
	
	c = add2(x, y);

	for(j=0;j<10;j++) printf("%4d",c[j]);

}
*/

/***********************************************************/
// [예비문제 4] : 변수의 선언과 가시성
// 다음 프로그램의 에러와 경고가 발생하는 곳을 
// 지적하시오. 컴파일러마다 결과는 다를 수 있음�
/***********************************************************/

/*
int a = 100;   
int b = 10*2; 
int c = sizeof(int);
int d = a + 1;
int *p = &a;

int add(int a, int b)
{
	return a+b;
}

void main(void)
{
	int a = b;
	int b = c;
	int c = c * 2;
	int d[3] = {a, b};
	int e = add(a,b);
	static int s = a;
	
	printf("a=%d\n", a);
	printf("b=%d\n", b);
	printf("c=%d\n", c);
	printf("d=%d\n", e);
}
*/

/***********************************************************/
// [1] : 변수의 유효범위
// 다음 프로그램의 오류를 수정하시오
// 다음 프로그램의 실행 결과는?
/***********************************************************/

/*
void func_a(int a, int b);

int a = 1, b = 2, c, d;

void main(void)
{
	int a = 10, b, c = a * 2;

	func_a(b = a+c, a);
	a = b + c + a;
	printf("%d	%d\n", a, d);
}

void func_a(int a, int b)
{
	int d;
	d = a+b;
	printf("%d	%d\n", c, d);
}
*/

/***********************************************************/
// [2] : 중첩된 지역변수의 유효범위
// 다음 프로그램의 실행 결과는?
/***********************************************************/

/*
int i = 1; int j; int k = 100;

void main(void)
{
	auto int i = 0; register int j = 10;

	{
		int i = 20;
		printf("%d\n",i+j+k);
	}
	printf("%d\n",i+j+k);
}
*/

/***********************************************************/
// [3] : Local에서의 Static 선언
// 다음 프로그램의 실행 결과는?
/***********************************************************/


void f1(void);

int a = 10;	 static int s = 20;

void main(void)
{
	static int s; 

	a++, s++;
	printf("%d %d\n", a, s);
	f1();
	a++, s++;
	printf("%d %d\n", a, s);
	f1();
}

void f1(void)
{
	int a = 1; static int s = 2;

	a++, s++;
	printf("%d %d\n", a, s);
}


/***********************************************************/
// [4] : Local에서의 Extern 선언
// 다음 프로그램의 실행 결과는?
// 한 파일에서 local의 extern은 의미가 있는가?
/***********************************************************/

/*
void func_inc(void);
int i;

void main(void)
{	
	i++;
	func_inc();
}

void func_inc(void)
{
	extern int i;  
	i++; 
	printf("%d\n", i);
}
*/

/***********************************************************/
// [5] : 함수의 재귀호출
// 다음 프로그램의 실행 결과는?
// 스택의 동작을 예측하시오
/***********************************************************/

/*
int fact(int x)
{
	if(x == 0) 
	{
		return (1);
	}
	else	   
	{
		return (x * fact(x-1));  // ==> [1]
	}
}

void main(void)
{
	int i;
	i = fact(3);   // ==> [2]
	printf("%d! => %d\n", 3, i);
}
*/

/***********************************************************/
// [6] : 전역변수의 유효범위
// Main2.c 도 함께 컴파일 할것
// 다음 프로그램의 실행 결과는?
/***********************************************************/

/*
extern void fa(void);
int a;

void main(void)
{
	a++;
	fa( );
	printf("%d\n",a);
}
*/
