/*===== << 이 부분은 실습을 위하여 수정 금지 >> =====*/
#include "my_lib.h"
#define 	printf		Uart_Printf
#define 	main		User_Main
void User_Main(void);
void Main(void)
{
	Uart_Init(115200);	
	printf("\n=================================\n");
	main();
	printf("=================================\n");
}

/*===== << 여기부터 사용자 프로그램을 작성함 >> =====*/

/***********************************************************/
// [1] : Hello C!
/***********************************************************/

///*
void main(void)
{
	printf("Hello C!\n");
}
//*/

/***********************************************************/
// [2] : 실수로 넣은 따옴표
// 다음의 결과는? 에러? 경고?
// 정말로 Hello"" C!\n 를 인쇄되게 하려면? 
/***********************************************************/

/*
void main(void)
{
	printf("Hello"" C!\n");
}
*/

/***********************************************************/
// [3] : printf( )의 escape sequence
// 무엇이 인쇄될까요?
// escape sequence란?
/***********************************************************/

/*
void main(void)
{
	printf("New Line은 \n으로 합니다.\n");

	printf("New Line은 \\n으로 합니다.\n");

	// %는 %로 막고 나머지는 \로 막는다.
	printf("What? \"%%%%%%\"\n");
}
*/
